In [5]:
import pandas
pandas.__version__

'1.1.3'

In [6]:
import pandas as pd
import numpy as np

In [8]:
np.__version__

'1.19.2'

In [9]:
cnt = pd.Series([100,102,104,106,108])
cnt

0    100
1    102
2    104
3    106
4    108
dtype: int64

In [10]:
cnt.values

array([100, 102, 104, 106, 108], dtype=int64)

In [11]:
cnt.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
import pandas as pd
b = pd.Series([100,102,104,106],
    index = ['aa','ab','ac','ad'])
print(b)

aa    100
ab    102
ac    104
ad    106
dtype: int64

In [18]:
b['ac']

104

In [19]:
b.name = 'x'
b.index.name = 'id'
b

id
aa    100
ab    102
ac    104
ad    106
Name: x, dtype: int64

In [27]:
b[0]

100

In [24]:
import numpy as np
np.log(b)

id
aa    4.605170
ab    4.624973
ac    4.644391
ad    4.663439
Name: x, dtype: float64

In [31]:
b[b>110]

Series([], Name: x, dtype: int64)

In [26]:
b[b>102]

id
ac    104
ad    106
Name: x, dtype: int64

In [28]:
b_dict = {'aa':10,'ab':12,'ac':14,'ad':16,'ae':18}
print(b_dict)

{'aa': 10, 'ab': 12, 'ac': 14, 'ad': 16, 'ae': 18}

In [29]:
pd.Series(b_dict)

aa    10
ab    12
ac    14
ad    16
ae    18
dtype: int64

In [32]:
d = {"Sname":["KRISHNA","RAHUL","AMAN","SOURAV","AKASH"],
    "Year":[2017,2017,2017,2016,2016],
    "Rate":[10,9,9,9,9]}

In [33]:
print(d)

{'Sname': ['KRISHNA', 'RAHUL', 'AMAN', 'SOURAV', 'AKASH'], 'Year': [2017, 2017, 2017, 2016, 2016], 'Rate': [10, 9, 9, 9, 9]}

In [34]:
d=pd.DataFrame(d)
d

     Sname  Year  Rate
0  KRISHNA  2017    10
1    RAHUL  2017     9
2     AMAN  2017     9
3   SOURAV  2016     9
4    AKASH  2016     9

In [35]:
df = pd.DataFrame(d,columns=["Year","Sname","Rate"])
print(df)

   Year    Sname  Rate
0  2017  KRISHNA    10
1  2017    RAHUL     9
2  2017     AMAN     9
3  2016   SOURAV     9
4  2016    AKASH     9

In [36]:
df['NewCol']=df.Year/df.Rate
df

   Year    Sname  Rate      NewCol
0  2017  KRISHNA    10  201.700000
1  2017    RAHUL     9  224.111111
2  2017     AMAN     9  224.111111
3  2016   SOURAV     9  224.000000
4  2016    AKASH     9  224.000000

In [37]:
df['Serie_Aligned'] = pd.Series(range(4), index =[0,1,2,3,])
df

   Year    Sname  Rate      NewCol  Serie_Aligned
0  2017  KRISHNA    10  201.700000            0.0
1  2017    RAHUL     9  224.111111            1.0
2  2017     AMAN     9  224.111111            2.0
3  2016   SOURAV     9  224.000000            3.0
4  2016    AKASH     9  224.000000            NaN

In [38]:
df.to_dict()

{'Year': {0: 2017, 1: 2017, 2: 2017, 3: 2016, 4: 2016},
 'Sname': {0: 'KRISHNA', 1: 'RAHUL', 2: 'AMAN', 3: 'SOURAV', 4: 'AKASH'},
 'Rate': {0: 10, 1: 9, 2: 9, 3: 9, 4: 9},
 'NewCol': {0: 201.7,
  1: 224.11111111111111,
  2: 224.11111111111111,
  3: 224.0,
  4: 224.0},
 'Serie_Aligned': {0: 0.0, 1: 1.0, 2: 2.0, 3: 3.0, 4: nan}}

In [39]:
pd.DataFrame(df.to_dict())

   Year    Sname  Rate      NewCol  Serie_Aligned
0  2017  KRISHNA    10  201.700000            0.0
1  2017    RAHUL     9  224.111111            1.0
2  2017     AMAN     9  224.111111            2.0
3  2016   SOURAV     9  224.000000            3.0
4  2016    AKASH     9  224.000000            NaN

In [40]:
data = [{'a':i,'b':10*i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [41]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [42]:
x = [{'u':i*i,'b':100*i}for i in range(10)]
print(x)

[{'u': 0, 'b': 0}, {'u': 1, 'b': 100}, {'u': 4, 'b': 200}, {'u': 9, 'b': 300}, {'u': 16, 'b': 400}, {'u': 25, 'b': 500}, {'u': 36, 'b': 600}, {'u': 49, 'b': 700}, {'u': 64, 'b': 800}, {'u': 81, 'b': 900}]

In [43]:
pd.DataFrame(x)

    u    b
0   0    0
1   1  100
2   4  200
3   9  300
4  16  400
5  25  500
6  36  600
7  49  700
8  64  800
9  81  900

In [44]:
y = [{'u':1,'v':2},{'u':3,'w':4}]
pd.DataFrame(y)

   u    v    w
0  1  2.0  NaN
1  3  NaN  4.0

In [45]:
#NaN means Not a Number